

print('-----------------------------------------------------------------------------------------')
# Аннотация нужна программисту для упрожения работы.
# ai: int = 1
# af: float = 1.3

# b: str = 'asdf'
# c: list = [1,2,3] # массив
# d: tuple = (1,2,3) # массив константа с круглыми скобками!
# f: bool = False
# e = None
# g: dict = {
#     'a': 1,
#     'b': 2
# }


# c[0] = 0
# d[0]  = 0 # ошибка. менять нельзя




# print('Nothing')
# print('Will work')
# print('unless you do')

# print('-----------------------------------------------------------------------------------------')

# print('')
# print('')
# print('\t"Anyone who')
# print('\t   stops')
# print('\t      learning is old,')
# print('\t \t whether at twenty or eighty".')
# print('\t \t \t \t \t Henry Ford')

# print('-----------------------------------------------------------------------------------------')

# a = int(input('Введите число a: '))
# b = int(input('Введите число b: '))

# print('Сумма a и b: ', a + b)

# print('Разница a и b: ', a - b)

# print('Произведение a и b: ', a * b)

# print('-----------------------------------------------------------------------------------------')


# a = int(input('Введите число a (значение): '))
# b = int(input('Введите число b (процент): '))

# c = ( a / 100 ) * b

# print(b , ' процентов от ', a ,' это: ', c )

# print('-----------------------------------------------------------------------------------------')



# a = int(input('Введите число a (сторона a): '))
# b = int(input('Введите число b (сторона b): '))

# s =  a * b

# print(' Площадь прямоугольника: ' , s)

# print('-----------------------------------------------------------------------------------------')

def myfirstfoo():
    a = input('Введите число : ')

    sum: int = 0 
    j = 1

    for i in a:
        sum += int(i)
        print(j , ' разряд: ', i)
        j += 1
 

    if int(a) > 10:
        print(' больше 10')
    else:
        print(' меньше 10')

    
    print('Сумма цифр числа: ' , sum)
        

myfirstfoo()


def mysecondfoo():
    a = input('Введите число a: ')
    b = input('Введите число b: ')
    str = a + b
    print(str)

mysecondfoo()

def cinf():
    c = int(input('Температура по Цельсия: '))
    f = c * 9/5 + 32
    print(c, ' Градусов цельсия, это: ', f , 'Градусов по Фаренгейту')

cinf()


